// Напишите программу, которая на вход принимает число и выдает его квадрат (число умноженное на само себя).
Console.Clear();

Console.WriteLine("Enter number: ");

